spec/dummy/app/controllers/settings_models_controller.rb

SELECT "settings_models".* FROM "settings_models"
---
  def index
    @settings_models = SettingsModel.all

INSERT INTO "settings_models" ("data", "created_at", "updated_at") VALUES (?, ?, ?)  [["data", "--- MyString\n"], ["created_at", "2022-12-16 20:36:00.820189"], ["updated_at", "2022-12-16 20:36:00.820189"]]
---
  def create
    @settings_model = SettingsModel.new(settings_model_params)

    if @settings_model.save

DELETE FROM "settings_models" WHERE "settings_models"."id" = ?  [["id", 1]]
---
  def destroy
    @settings_model.destroy

SELECT "settings_models".* FROM "settings_models" WHERE "settings_models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_settings_model
      @settings_model = SettingsModel.find(params[:id])